---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentModelLine
source: html/59bf8ee1-e094-f337-94cd-abe12445b5b8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentModelLine Property

While making curved beam type "[Type Name]" some Model Line elements were not created

## Syntax (C#)
```csharp
public static FailureDefinitionId NotBentModelLine { get; }
```